qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_dma.h
/**
  * @brief  Set the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  * @param  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC2
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC3
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC2
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART5_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART5_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM6
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM7
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_TX
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_RX
  *         @arg @ref LL_SYSCFG_DMA_MAP_SDIO
  *         @arg @ref LL_SYSCFG_DMA_MAP_USB
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetDMARemap(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t MapReqNum)
{
  uint32_t position; 
  
  position = ((uint32_t)Channel - (uint32_t)LL_DMA_CHANNEL_1) / ((uint32_t)LL_DMA_CHANNEL_2 - (uint32_t)LL_DMA_CHANNEL_1);
  
  if(DMAx == DMA2)
  {
    position += 7U;
  }
  
  if(position<4)
  {
    MODIFY_REG(SYSCFG->CFGR[2], (0x7F << (8U * (position & 0x03U))), (MapReqNum << (8U * (position & 0x03U))));
  }
  else if(position<8)
  {
    position = position - 4;
    MODIFY_REG(SYSCFG->CFGR[3], (0x7F << (8U * (position & 0x03U))), (MapReqNum << (8U * (position & 0x03U))));
  }
  else
  {
    position = position - 8;
    MODIFY_REG(SYSCFG->CFGR[4], (0x7F << (8U * (position & 0x03U))), (MapReqNum << (8U * (position & 0x03U))));
  }
}

/**
  * @brief  Get the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  * @return  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC2
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC3
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC2
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART5_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART5_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM6
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM7
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_TRIG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_TX
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_RX
  *         @arg @ref LL_SYSCFG_DMA_MAP_SDIO
  *         @arg @ref LL_SYSCFG_DMA_MAP_USB
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDMARemap(DMA_TypeDef *DMAx,uint32_t Channel)
{
  uint32_t position;

  position = ((uint32_t)Channel - (uint32_t)LL_DMA_CHANNEL_1) / ((uint32_t)LL_DMA_CHANNEL_2 - (uint32_t)LL_DMA_CHANNEL_1);
  
  if(DMAx == DMA2)
  {
    position += 7U;
  }

  if(position<4)
  {
    return (READ_BIT(SYSCFG->CFGR[2], (0x7F << (8U * (position & 0x03U))))>>(8U * (position & 0x03U)));
  }
  else if(position<8)
  {
    position = position - 4;
    return (READ_BIT(SYSCFG->CFGR[3], (0x7F << (8U * (position & 0x03U))))>>(8U * (position & 0x03U)));
  }
  else
  {
    position = position - 8;
    return (READ_BIT(SYSCFG->CFGR[4], (0x7F << (8U * (position & 0x03U))))>>(8U * (position & 0x03U)));
  }
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup DMA_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

uint32_t LL_DMA_Init(DMA_TypeDef *DMAx, uint32_t Channel, LL_DMA_InitTypeDef *DMA_InitStruct);
uint32_t LL_DMA_DeInit(DMA_TypeDef *DMAx, uint32_t Channel);
void LL_DMA_StructInit(LL_DMA_InitTypeDef *DMA_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DMA1 || DMA2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32F403_LL_DMA_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
